org/2021-32.org
#+SETUPFILE: ./hugo_setup.org
#+TITLE: 2021 年第 32 周总结
#+DATE: <2021-08-08 Sun>
#+HUGO_TAGS: 总结
8.2-8.8

*只写对成长重要的事情*

周一：

- [X] 家庭网络中的「NAT」到底是什么？ [[https://sspai.com/post/68037]]
- [X] [[https://github.com/tianheg/blog/issues/126][SICP]]
  [[https://youtu.be/-J_xL4IGhJA?t=1433]]
- [X] [[https://github.com/tianheg/blog/issues/128][How I store my files
  and why you should not rely on fancy tools for backup]]
- [X] [[https://github.com/tianheg/blog/issues/129][Using GitHub Copilot
  will turn you into a bad programmer]]
- [X] [[https://github.com/tianheg/blog/issues/130][Keeping your home in
  Git, the right way]]

周二：

- [X] 重装系统 Ubuntu20.04 to MX Linux19.4

周三：

- [X] 重装系统 Ubuntu20.04 to MX Linux19.4

周四：

- [X] read MXLinux FAQ

周五：

- [X] MX Linux to Arch Linux

周六：

- [X] MX Linux to Arch Linux

周日：

思考：

- 我要早起（形成惯性：6:00 起床，我需要午夜前睡着，11:30pm 上床）
- 每天阅读 2 篇英文长文（非技术）
- 每天通过文章/视频接触一个工具/实践
- 每日 CSS 画画 [[https://codepen.io/collection/ZMYLGx]] ref:
  [[https://blog.prototypr.io/how-i-started-drawing-css-images-3fd878675c89][1]]
  [[https://github.com/antfu/100][2]]
- 一个阅读别人文章的技巧：+先使用纸质笔记记录，增加记忆深度、摩擦力，然后把整理后的内容转成电子文档+
  笔记记在 issues，完善到一定程度发布到 blog
- 形成任务流程：SICP、计算机网络、HTMLCSSJS、Vue
- blog 偏向于解决问题（关于某个共同问题的创新性解决办法），til
  用于形成做某件事的流程
- 买一个能 root 的二手手机
- 编程：将人的需求翻译成计算机语言

问题：

- 人的主观意识如何体现？当人想或不想做某些事情的时候，这个想与不想的情感/感觉是怎样产生的？
