blog/2021/2021-32.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-07 Mon 22:00 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>2021 年第 32 周总结</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">2021 年第 32 周总结</h1>
</header><p>
8.2-8.8
</p>

<p>
<b>只写对成长重要的事情</b>
</p>

<p>
周一：
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> 家庭网络中的「NAT」到底是什么？ <a href="https://sspai.com/post/68037">https://sspai.com/post/68037</a></li>
<li class="on"><code>[X]</code> <a href="https://github.com/tianheg/blog/issues/126">SICP</a>
<a href="https://youtu.be/-J_xL4IGhJA?t=1433">https://youtu.be/-J_xL4IGhJA?t=1433</a></li>
<li class="on"><code>[X]</code> <a href="https://github.com/tianheg/blog/issues/128">How I store my files
and why you should not rely on fancy tools for backup</a></li>
<li class="on"><code>[X]</code> <a href="https://github.com/tianheg/blog/issues/129">Using GitHub Copilot
will turn you into a bad programmer</a></li>
<li class="on"><code>[X]</code> <a href="https://github.com/tianheg/blog/issues/130">Keeping your home in
Git, the right way</a></li>
</ul>

<p>
周二：
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> 重装系统 Ubuntu20.04 to MX Linux19.4</li>
</ul>

<p>
周三：
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> 重装系统 Ubuntu20.04 to MX Linux19.4</li>
</ul>

<p>
周四：
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> read MXLinux FAQ</li>
</ul>

<p>
周五：
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> MX Linux to Arch Linux</li>
</ul>

<p>
周六：
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> MX Linux to Arch Linux</li>
</ul>

<p>
周日：
</p>

<p>
思考：
</p>

<ul class="org-ul">
<li>我要早起（形成惯性：6:00 起床，我需要午夜前睡着，11:30pm 上床）</li>
<li>每天阅读 2 篇英文长文（非技术）</li>
<li>每天通过文章/视频接触一个工具/实践</li>
<li>每日 CSS 画画 <a href="https://codepen.io/collection/ZMYLGx">https://codepen.io/collection/ZMYLGx</a> ref:
<a href="https://blog.prototypr.io/how-i-started-drawing-css-images-3fd878675c89">1</a>
<a href="https://github.com/antfu/100">2</a></li>
<li>一个阅读别人文章的技巧：+先使用纸质笔记记录，增加记忆深度、摩擦力，然后把整理后的内容转成电子文档+
笔记记在 issues，完善到一定程度发布到 blog</li>
<li>形成任务流程：SICP、计算机网络、HTMLCSSJS、Vue</li>
<li>blog 偏向于解决问题（关于某个共同问题的创新性解决办法），til
用于形成做某件事的流程</li>
<li>买一个能 root 的二手手机</li>
<li>编程：将人的需求翻译成计算机语言</li>
</ul>

<p>
问题：
</p>

<ul class="org-ul">
<li>人的主观意识如何体现？当人想或不想做某些事情的时候，这个想与不想的情感/感觉是怎样产生的？</li>
</ul>
</div>
</body>
</html>